//THE LIFE모듈입니다.

//접두사
const prex = '!';

exports.Lifecmd = {

    //가입명령어
    'join' : prex + '가입',

    //해시코드명령어
    'Hash' : prex + '해시코드',

    //프로필 새로고침 명령어
    'refresh' : prex + '새로고침',
    
    //설정
    'setting' : /^!설정 (\d+) , (.+)$/,

    //도움말명령어
    'help' : prex + '도움말',

    //내정보명령어
    'myprofile' : prex + '내정보',
    
    //상대방정보명령어
    'eprofile' : /^!정보 @?(.+)$/,
        
    //광질명령어
    'orestart' : prex + '광질',
    
    //광물 가방명령어
    'bag' : prex + '가방',
    
    //광물 가방명령어
    'ebag' : /^!가방 @?(.+)$/,
    
    //잠금명령어 (랭크, 광물번호)
    'lock' : prex + 'G잠금',
    
    //잠금해제명령어 ('')
    'unlock' : prex + 'G잠금해제',

    'sell' : prex + 'G판매',

    'allsell' : prex + 'G일괄판매',

    //---------------------------------관리자 명령어
    
    //밴명령어
    'ban' : /^!밴 @?(.+)$/,

    //밴해제명령어
    'unban' : /^!언밴 @?(.+)$/,

    //등록
    'rk' : /^!등급 @?(.+) , (\d+)$/
    
};

/*
exports.lifeTips = {

    //가입명령어팁
    'Tjoin' : + '가입',

    //프로필 새로고침 명령어팁
    'Trefresh' : + '새로고침',

    //도움말명령어팁
    'Thelp' : + '도움말',

    //내정보명령어팁
    'Tmyprofile' : + '내정보',

    //상대방정보명령어팁
    'Teprofile' : + '정보',

    //광질명령어팁
    'Torestart' : + '광질',

    //광물 가방명령어팁
    'Tbag' : + '가방',

    //잠금명령어팁 (랭크, 광물번호)
    'Tlock' : + '잠금',

    //잠금해제명령어팁 ('')
    'Tunlock' : + '잠금해제'

}
*/